project-chip/connectedhomeip/src/platform/nRF5/nRF5Config.cpp
/*
 *
 *    <COPYRIGHT>
 *
 *    Licensed under the Apache License, Version 2.0 (the "License");
 *    you may not use this file except in compliance with the License.
 *    You may obtain a copy of the License at
 *
 *        http://www.apache.org/licenses/LICENSE-2.0
 *
 *    Unless required by applicable law or agreed to in writing, software
 *    distributed under the License is distributed on an "AS IS" BASIS,
 *    WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 *    See the License for the specific language governing permissions and
 *    limitations under the License.
 */

/**
 *    @file
 *          Utilities for accessing persisted device configuration on
 *          platforms based on the Nordic nRF5 SDK.
 */

#include <atomic>

#include <platform/internal/CHIPDeviceLayerInternal.h>
#include <platform/nRF5/nRF5Config.h>
#include <core/CHIPEncoding.h>
#include <platform/internal/testing/ConfigUnitTest.h>

#include "FreeRTOS.h"
#include "semphr.h"

#include "fds.h"
#include "mem_manager.h"

namespace chip {
namespace DeviceLayer {
namespace Internal {

NRF5Config::FDSAsyncOp * volatile NRF5Config::sActiveAsyncOp;
SemaphoreHandle_t NRF5Config::sAsyncOpCompletionSem;

CHIP_ERROR NRF5Config::Init()
{
    CHIP_ERROR err;
    ret_code_t fdsRes;

    // Create a semaphore to signal the completion of async FDS operations.
    sAsyncOpCompletionSem = xSemaphoreCreateBinary();
    VerifyOrExit(sAsyncOpCompletionSem != NULL, err = CHIP_ERROR_NO_MEMORY);

    // Register an FDS event handler.
    fdsRes = fds_register(HandleFDSEvent);
    SuccessOrExit(err = MapFDSError(fdsRes));

    // Initialize the FDS module.
    {
        FDSAsyncOp initOp(FDSAsyncOp::kInit);
        err = DoAsyncFDSOp(initOp);
        SuccessOrExit(err);
    }

exit:
    return err;
}

CHIP_ERROR NRF5Config::ReadConfigValue(Key key, bool & val)
{
    CHIP_ERROR err;
    fds_record_desc_t recDesc;
    fds_flash_record_t rec;
    uint32_t wordVal;
    bool needClose = false;

    err = OpenRecord(key, recDesc, rec);
    SuccessOrExit(err);
    needClose = true;

    VerifyOrExit(rec.p_header->length_words == 1, err = CHIP_ERROR_INVALID_ARGUMENT);

    wordVal = Encoding::LittleEndian::Get32((const uint8_t *)rec.p_data);
    val = (wordVal != 0);

exit:
    if (needClose)
    {
        fds_record_close(&recDesc);
    }
    return err;
}

CHIP_ERROR NRF5Config::ReadConfigValue(Key key, uint32_t & val)
{
    CHIP_ERROR err;
    fds_record_desc_t recDesc;
    fds_flash_record_t rec;
    bool needClose = false;

    err = OpenRecord(key, recDesc, rec);
    SuccessOrExit(err);
    needClose = true;

    VerifyOrExit(rec.p_header->length_words == 1, err = CHIP_ERROR_INVALID_ARGUMENT);

    val = Encoding::LittleEndian::Get32((const uint8_t *)rec.p_data);

exit:
    if (needClose)
    {
        fds_record_close(&recDesc);
    }
    return err;
}

CHIP_ERROR NRF5Config::ReadConfigValue(Key key, uint64_t & val)
{
    CHIP_ERROR err;
    fds_record_desc_t recDesc;
    fds_flash_record_t rec;
    bool needClose = false;

    err = OpenRecord(key, recDesc, rec);
    SuccessOrExit(err);
    needClose = true;

    VerifyOrExit(rec.p_header->length_words == 2, err = CHIP_ERROR_INVALID_ARGUMENT);

    val = Encoding::LittleEndian::Get64((const uint8_t *)rec.p_data);

exit:
    if (needClose)
    {
        fds_record_close(&recDesc);
    }
    return err;
}

CHIP_ERROR NRF5Config::ReadConfigValueStr(Key key, char * buf, size_t bufSize, size_t & outLen)
{
    CHIP_ERROR err;
    fds_flash_record_t rec;
    fds_record_desc_t recDesc;
    bool needClose = false;
    const uint8_t * strEnd;

    err = OpenRecord(key, recDesc, rec);
    SuccessOrExit(err);
    needClose = true;

    strEnd = (const uint8_t *)memchr(rec.p_data, 0, rec.p_header->length_words * kFDSWordSize);
    VerifyOrExit(strEnd != NULL, err = CHIP_ERROR_INVALID_ARGUMENT);

    outLen = strEnd - (const uint8_t *)rec.p_data;

    // NOTE: the caller is allowed to pass NULL for buf to query the length of the stored
    // value.

    if (buf != NULL)
    {
        VerifyOrExit(bufSize > outLen, err = CHIP_ERROR_BUFFER_TOO_SMALL);

        memcpy(buf, rec.p_data, outLen + 1);
    }

exit:
    if (needClose)
    {
        fds_record_close(&recDesc);
    }
    return err;
}

CHIP_ERROR NRF5Config::ReadConfigValueBin(Key key, uint8_t * buf, size_t bufSize, size_t & outLen)
{
    CHIP_ERROR err;
    fds_flash_record_t rec;
    fds_record_desc_t recDesc;
    bool needClose = false;

    err = OpenRecord(key, recDesc, rec);
    SuccessOrExit(err);
    needClose = true;

    VerifyOrExit(rec.p_header->length_words >= 1, err = CHIP_ERROR_INVALID_ARGUMENT);

    // First two bytes are length.
    outLen = Encoding::LittleEndian::Get16((const uint8_t *)rec.p_data);

    VerifyOrExit((rec.p_header->length_words * kFDSWordSize) >= (outLen + 2), err = CHIP_ERROR_INVALID_ARGUMENT);

    // NOTE: the caller is allowed to pass NULL for buf to query the length of the stored
    // value.

    if (buf != NULL)
    {
        VerifyOrExit(bufSize >= outLen, err = CHIP_ERROR_BUFFER_TOO_SMALL);

        memcpy(buf, ((const uint8_t *)rec.p_data) + 2, outLen);
    }

exit:
    if (needClose)
    {
        fds_record_close(&recDesc);
    }
    return err;
}

CHIP_ERROR NRF5Config::WriteConfigValue(Key key, bool val)
{
    CHIP_ERROR err;
    uint32_t storedVal = (val) ? 1 : 0;

    FDSAsyncOp addOrUpdateOp(FDSAsyncOp::kAddOrUpdateRecord);
    addOrUpdateOp.FileId = GetFileId(key);
    addOrUpdateOp.RecordKey = GetRecordKey(key);
    addOrUpdateOp.RecordData = (const uint8_t *)&storedVal;
    addOrUpdateOp.RecordDataLengthWords = 1;

    err = DoAsyncFDSOp(addOrUpdateOp);
    SuccessOrExit(err);

    ChipLogProgress(DeviceLayer, "FDS set: %04" PRIX16 "/%04" PRIX16 " = %s", GetFileId(key), GetRecordKey(key), val ? "true" : "false");

exit:
    return err;
}

CHIP_ERROR NRF5Config::WriteConfigValue(Key key, uint32_t val)
{
    CHIP_ERROR err;

    FDSAsyncOp addOrUpdateOp(FDSAsyncOp::kAddOrUpdateRecord);
    addOrUpdateOp.FileId = GetFileId(key);
    addOrUpdateOp.RecordKey = GetRecordKey(key);
    addOrUpdateOp.RecordData = (const uint8_t *)&val;
    addOrUpdateOp.RecordDataLengthWords = 1;

    err = DoAsyncFDSOp(addOrUpdateOp);
    SuccessOrExit(err);

    ChipLogProgress(DeviceLayer, "FDS set: 0x%04" PRIX16 "/0x%04" PRIX16 " = %" PRIu32 " (0x%" PRIX32 ")", GetFileId(key), GetRecordKey(key), val, val);

