project-chip/connectedhomeip/src/platform/nRF5/nRF5Config.cpp
exit:
    return err;
}

CHIP_ERROR NRF5Config::WriteConfigValue(Key key, uint64_t val)
{
    CHIP_ERROR err;

    FDSAsyncOp addOrUpdateOp(FDSAsyncOp::kAddOrUpdateRecord);
    addOrUpdateOp.FileId = GetFileId(key);
    addOrUpdateOp.RecordKey = GetRecordKey(key);
    addOrUpdateOp.RecordData = (const uint8_t *)&val;
    addOrUpdateOp.RecordDataLengthWords = 2;

    err = DoAsyncFDSOp(addOrUpdateOp);
    SuccessOrExit(err);

    ChipLogProgress(DeviceLayer, "FDS set: 0x%04" PRIX16 "/0x%04" PRIX16 " = %" PRIu64 " (0x%" PRIX64 ")", GetFileId(key), GetRecordKey(key), val, val);

exit:
    return err;
}

CHIP_ERROR NRF5Config::WriteConfigValueStr(Key key, const char * str)
{
    return WriteConfigValueStr(key, str, (str != NULL) ? strlen(str) : 0);
}

CHIP_ERROR NRF5Config::WriteConfigValueStr(Key key, const char * str, size_t strLen)
{
    CHIP_ERROR err;
    uint8_t * storedVal = NULL;

    if (str != NULL)
    {
        uint32_t storedValWords = FDSWords(strLen + 1);

        storedVal = (uint8_t *)nrf_malloc(storedValWords * kFDSWordSize);
        VerifyOrExit(storedVal != NULL, err = CHIP_ERROR_NO_MEMORY);

        memcpy(storedVal, str, strLen);
        storedVal[strLen] = 0;

        FDSAsyncOp addOrUpdateOp(FDSAsyncOp::kAddOrUpdateRecord);
        addOrUpdateOp.FileId = GetFileId(key);
        addOrUpdateOp.RecordKey = GetRecordKey(key);
        addOrUpdateOp.RecordData = storedVal;
        addOrUpdateOp.RecordDataLengthWords = storedValWords;

        err = DoAsyncFDSOp(addOrUpdateOp);
        SuccessOrExit(err);

        ChipLogProgress(DeviceLayer, "FDS set: 0x%04" PRIX16 "/0x%04" PRIX16 " = \"%s\"", GetFileId(key), GetRecordKey(key), (const char *)storedVal);
    }

    else
    {
        err = ClearConfigValue(key);
        SuccessOrExit(err);
    }

exit:
    if (storedVal != NULL)
    {
        nrf_free(storedVal);
    }
    return err;
}

CHIP_ERROR NRF5Config::WriteConfigValueBin(Key key, const uint8_t * data, size_t dataLen)
{
    CHIP_ERROR err;
    uint8_t * storedVal = NULL;

    if (data != NULL)
    {
        uint32_t storedValWords = FDSWords(dataLen + 2);

        storedVal = (uint8_t *)nrf_malloc(storedValWords * kFDSWordSize);
        VerifyOrExit(storedVal != NULL, err = CHIP_ERROR_NO_MEMORY);

        // First two bytes encode the length.
        Encoding::LittleEndian::Put16(storedVal, (uint16_t)dataLen);

        memcpy(storedVal + 2, data, dataLen);

        FDSAsyncOp addOrUpdateOp(FDSAsyncOp::kAddOrUpdateRecord);
        addOrUpdateOp.FileId = GetFileId(key);
        addOrUpdateOp.RecordKey = GetRecordKey(key);
        addOrUpdateOp.RecordData = storedVal;
        addOrUpdateOp.RecordDataLengthWords = storedValWords;

        err = DoAsyncFDSOp(addOrUpdateOp);
        SuccessOrExit(err);

        ChipLogProgress(DeviceLayer, "FDS set: 0x%04" PRIX16 "/0x%04" PRIX16 " = (blob length %" PRId32 ")", GetFileId(key), GetRecordKey(key), dataLen);
    }

    else
    {
        err = ClearConfigValue(key);
        SuccessOrExit(err);
    }

exit:
    if (storedVal != NULL)
    {
        nrf_free(storedVal);
    }
    return err;
}

CHIP_ERROR NRF5Config::ClearConfigValue(Key key)
{
    CHIP_ERROR err;

    FDSAsyncOp delOp(FDSAsyncOp::kDeleteRecordByKey);
    delOp.FileId = GetFileId(key);
    delOp.RecordKey = GetRecordKey(key);

    err = DoAsyncFDSOp(delOp);
    SuccessOrExit(err);

    ChipLogProgress(DeviceLayer, "FDS delete: 0x%04" PRIX16 "/0x%04" PRIX16, GetFileId(key), GetRecordKey(key));

exit:
    return err;
}

bool NRF5Config::ConfigValueExists(Key key)
{
    ret_code_t fdsRes;
    fds_record_desc_t recDesc;
    fds_find_token_t findToken;

    // Search for the requested record.
    memset(&findToken, 0, sizeof(findToken));
    fdsRes = fds_record_find(GetFileId(key), GetRecordKey(key), &recDesc, &findToken);

    // Return true iff the record was found.
    return fdsRes == FDS_SUCCESS;
}

CHIP_ERROR NRF5Config::FactoryResetConfig(void)
{
    CHIP_ERROR err;

    // Delete the chipConfig file and all records its contains.
    {
        FDSAsyncOp delOp(FDSAsyncOp::kDeleteFile);
        delOp.FileId = kFileId_ChipConfig;
        err = DoAsyncFDSOp(delOp);
        SuccessOrExit(err);
        ChipLogProgress(DeviceLayer, "FDS delete file: 0x%04" PRIX16, kFileId_ChipConfig);
    }

    // Force a GC
    {
        FDSAsyncOp gcOp(FDSAsyncOp::kGC);
        err = DoAsyncFDSOp(gcOp);
        SuccessOrExit(err);
    }

exit:
    return err;
}

CHIP_ERROR NRF5Config::MapFDSError(ret_code_t fdsRes)
{
    return (fdsRes == FDS_SUCCESS) ? CHIP_NO_ERROR : CHIP_DEVICE_CONFIG_NRF5_FDS_ERROR_MIN + fdsRes;
}

CHIP_ERROR NRF5Config::OpenRecord(NRF5Config::Key key, fds_record_desc_t & recDesc, fds_flash_record_t & rec)
{
    CHIP_ERROR err;
    ret_code_t fdsRes;
    fds_find_token_t findToken;

    // Search for the requested record.  Return "CONFIG_NOT_FOUND" if it doesn't exist.
    memset(&findToken, 0, sizeof(findToken));
    fdsRes = fds_record_find(NRF5Config::GetFileId(key), NRF5Config::GetRecordKey(key), &recDesc, &findToken);
    err = (fdsRes == FDS_ERR_NOT_FOUND) ? CHIP_DEVICE_ERROR_CONFIG_NOT_FOUND : MapFDSError(fdsRes);
    SuccessOrExit(err);

    // Open the record for reading.
    fdsRes = fds_record_open(&recDesc, &rec);
    err = MapFDSError(fdsRes);
    SuccessOrExit(err);

exit:
    return err;
}

CHIP_ERROR NRF5Config::ForEachRecord(uint16_t fileId, uint16_t recordKey, ForEachRecordFunct funct)
{
    CHIP_ERROR err = CHIP_NO_ERROR;;
    ret_code_t fdsRes;
    fds_find_token_t findToken;
    fds_record_desc_t recDesc;
    fds_flash_record_t rec;
    bool needClose = false;

    memset(&findToken, 0, sizeof(findToken));

    while (true)
    {
        // Search for an occurrence of the requested record.  If there are no more records, break the loop.
        fdsRes = fds_record_find(fileId, recordKey, &recDesc, &findToken);
        if (fdsRes == FDS_ERR_NOT_FOUND)
        {
            break;
        }
        err = MapFDSError(fdsRes);
        SuccessOrExit(err);

