project-chip/connectedhomeip/src/platform/nRF5/nRF5Config.cpp
        // Open the record for reading.
        fdsRes = fds_record_open(&recDesc, &rec);
        err = MapFDSError(fdsRes);
        SuccessOrExit(err);
        needClose = true;

        bool deleteRec = false;

        // Invoke the caller's function.
        err = funct(rec, deleteRec);
        SuccessOrExit(err);

        // Close the record.
        needClose = false;
        fdsRes = fds_record_close(&recDesc);
        err = MapFDSError(fdsRes);
        SuccessOrExit(err);

        // Delete the record if requested.
        if (deleteRec)
        {
            FDSAsyncOp delOp(FDSAsyncOp::kDeleteRecord);
            delOp.FileId = fileId;
            delOp.RecordKey = recordKey;
            delOp.RecordDesc = recDesc;
            err = DoAsyncFDSOp(delOp);
            SuccessOrExit(err);
        }
    }

exit:
    if (needClose)
    {
        fds_record_close(&recDesc);
    }
    return err;
}

CHIP_ERROR NRF5Config::DoAsyncFDSOp(FDSAsyncOp & asyncOp)
{
    CHIP_ERROR err;
    ret_code_t fdsRes;
    fds_record_t rec;
    bool gcPerformed = false;

    // Keep trying to perform the requested op until there's a definitive success or failure...
    while (true)
    {
        bool existingRecFound = false;

        // If performing an AddOrUpdateRecord or DeleteRecordByKey, search for an existing record with the given key.
        if (asyncOp.OpType == FDSAsyncOp::kAddOrUpdateRecord || asyncOp.OpType == FDSAsyncOp::kDeleteRecordByKey)
        {
            fds_find_token_t findToken;
            memset(&findToken, 0, sizeof(findToken));
            fdsRes = fds_record_find(asyncOp.FileId, asyncOp.RecordKey, &asyncOp.RecordDesc, &findToken);
            VerifyOrExit(fdsRes == FDS_SUCCESS || fdsRes == FDS_ERR_NOT_FOUND, err = MapFDSError(fdsRes));

            // Remember if we found an existing record.
            existingRecFound = (fdsRes == FDS_SUCCESS);
        }

        // If adding or updating a record, prepare the FDS record structure with the record data.
        if (asyncOp.OpType == FDSAsyncOp::kAddRecord ||
            asyncOp.OpType == FDSAsyncOp::kUpdateRecord ||
            asyncOp.OpType == FDSAsyncOp::kAddOrUpdateRecord)
        {
            memset(&rec, 0, sizeof(rec));
            rec.file_id = asyncOp.FileId;
            rec.key = asyncOp.RecordKey;
            rec.data.p_data = asyncOp.RecordData;
            rec.data.length_words = asyncOp.RecordDataLengthWords;
        }

        // Make the requested op the active op.
        sActiveAsyncOp = &asyncOp;

        // Initiate the requested FDS operation.
        switch (asyncOp.OpType)
        {
        case FDSAsyncOp::kInit:
            fdsRes = fds_init();
            break;
        case FDSAsyncOp::kAddOrUpdateRecord:
            // Depending on whether an existing record was found, call fds_record_write or fds_record_update.
            if (!existingRecFound)
            {
        case FDSAsyncOp::kAddRecord:
                fdsRes = fds_record_write(NULL, &rec);
                break;
            }
            else
            {
        case FDSAsyncOp::kUpdateRecord:
                fdsRes = fds_record_update(&asyncOp.RecordDesc, &rec);
                break;
            }
        case FDSAsyncOp::kDeleteRecordByKey:
            // If performing a kDeleteRecordByKey and no matching record was found, simply return success.
            if (!existingRecFound)
            {
                ExitNow(err = CHIP_NO_ERROR);
            }
            // fall through...
        case FDSAsyncOp::kDeleteRecord:
            fdsRes = fds_record_delete(&asyncOp.RecordDesc);
            break;
        case FDSAsyncOp::kDeleteFile:
            fdsRes = fds_file_delete(asyncOp.FileId);
            break;
        case FDSAsyncOp::kGC:
            fdsRes = fds_gc();
            break;
        case FDSAsyncOp::kWaitQueueSpaceAvailable:
            // In this case, arrange to wait for any operation to complete, which coincides with
            // space on the operation queue being available.
            fdsRes = FDS_SUCCESS;
            break;
        default:
            ChipDie();
        }

        // If the operation was queued successfully, wait for it to complete and retrieve the result.
        // If the FreeRTOS scheduler is not running, poll the completion semaphore; otherwise wait
        // indefinitely.
        //
        if (fdsRes == FDS_SUCCESS)
        {
            if (xTaskGetSchedulerState() == taskSCHEDULER_NOT_STARTED)
            {
                while (xSemaphoreTake(sAsyncOpCompletionSem, 0) == pdFALSE)
                    ;
            }
            else
            {
                xSemaphoreTake(sAsyncOpCompletionSem, portMAX_DELAY);
            }

            fdsRes = asyncOp.Result;
        }

        // Clear the active operation in case it wasn't done by the event handler.
        sActiveAsyncOp = NULL;

        // Return immediately if the operation completed successfully.
        if (fdsRes == FDS_SUCCESS)
        {
            ExitNow(err = CHIP_NO_ERROR);
        }

        // If the operation failed for lack of flash space...
        if (fdsRes == FDS_ERR_NO_SPACE_IN_FLASH)
        {
            // If we've already performed a garbage collection, fail immediately.
            if (gcPerformed)
            {
                ExitNow(err = MapFDSError(fdsRes));
            }

            ChipLogProgress(DeviceLayer, "Initiating FDS GC to recover space");

            // Request a garbage collection cycle and wait for it to complete.
            FDSAsyncOp gcOp(FDSAsyncOp::kGC);
            err = DoAsyncFDSOp(gcOp);
            SuccessOrExit(err);

            // Repeat the requested operation.
            continue;
        }

        // If the write/update failed because the operation queue is full, wait for
        // space to become available and then repeat the requested operation.
        if (fdsRes == FDS_ERR_NO_SPACE_IN_QUEUES)
        {
            FDSAsyncOp waitOp(FDSAsyncOp::kWaitQueueSpaceAvailable);
            err = DoAsyncFDSOp(waitOp);
            SuccessOrExit(err);
            continue;
        }

        // If the operation timed out, simply try it again.
        if (fdsRes == FDS_ERR_OPERATION_TIMEOUT)
        {
            continue;
        }

