project-chip/connectedhomeip/src/platform/nRF5/nRF5Config.cpp
        // Otherwise fail with an unrecoverable error.
        ExitNow(err = MapFDSError(fdsRes));
    }

exit:
    return err;
}

void NRF5Config::HandleFDSEvent(const fds_evt_t * fdsEvent)
{
    // Do nothing if there's no async operation active.
    if (sActiveAsyncOp == NULL)
    {
        return;
    }

    // Check if the event applies to the active async operation.
    switch (sActiveAsyncOp->OpType)
    {
    case FDSAsyncOp::kInit:
        if (fdsEvent->id != FDS_EVT_INIT)
        {
            return;
        }
        break;
    case FDSAsyncOp::kAddOrUpdateRecord:
    case FDSAsyncOp::kAddRecord:
    case FDSAsyncOp::kUpdateRecord:
        // Ignore the event if its not a WRITE or UPDATE, or if its for a different file/record.
        if ((fdsEvent->id != FDS_EVT_WRITE && fdsEvent->id != FDS_EVT_UPDATE) ||
            fdsEvent->write.file_id != sActiveAsyncOp->FileId ||
            fdsEvent->write.record_key != sActiveAsyncOp->RecordKey)
        {
            return;
        }
        break;
    case FDSAsyncOp::kDeleteRecord:
    case FDSAsyncOp::kDeleteRecordByKey:
        // Ignore the event if its not a DEL_RECORD, or if its for a different file/record.
        if (fdsEvent->id != FDS_EVT_DEL_RECORD ||
            fdsEvent->del.record_id != sActiveAsyncOp->RecordDesc.record_id)
        {
            return;
        }
        break;
    case FDSAsyncOp::kDeleteFile:
        // Ignore the event if its not a DEL_FILE or its for a different file.
        if (fdsEvent->id != FDS_EVT_DEL_FILE || fdsEvent->del.file_id != sActiveAsyncOp->FileId)
        {
            return;
        }
        break;
    case FDSAsyncOp::kGC:
        // Ignore the event if its not a GC.
        if (fdsEvent->id != FDS_EVT_GC)
        {
            return;
        }
        break;
    case FDSAsyncOp::kWaitQueueSpaceAvailable:
        break;
    }

    // Capture the result.
    sActiveAsyncOp->Result = fdsEvent->result;

    // Mark the operation as complete.
    sActiveAsyncOp = NULL;

    // Signal the CHIP thread that the operation has completed.
#if defined(SOFTDEVICE_PRESENT) && SOFTDEVICE_PRESENT

    // When using the Nodic SoftDevice, HandleFDSEvent() is called in a SoftDevice interrupt
    // context.  Therefore, we must use xSemaphoreGiveFromISR() to signal completion.
    BaseType_t yieldRequired = xSemaphoreGiveFromISR(sAsyncOpCompletionSem, &yieldRequired);

    // Yield to the next runnable task, but only if the FreeRTOS scheduler has been started.
    if (xTaskGetSchedulerState() != taskSCHEDULER_NOT_STARTED && yieldRequired == pdTRUE)
    {
        portYIELD_FROM_ISR(yieldRequired);
    }

#else // defined(SOFTDEVICE_PRESENT) || !SOFTDEVICE_PRESENT

    // When NOT using the Nodic SoftDevice, HandleFDSEvent() is called in a non-interrupt
    // context. Therefore, use xSemaphoreGive() to signal completion.
    xSemaphoreGive(sAsyncOpCompletionSem);

#endif // !(defined(SOFTDEVICE_PRESENT) || !SOFTDEVICE_PRESENT)
}

void NRF5Config::RunConfigUnitTest()
{
    CHIP_ERROR err;

    // Run common unit test
    ::chip::DeviceLayer::Internal::RunConfigUnitTest<NRF5Config>();

    // NRF Config Test 1 -- Force GC
    {
        const static uint8_t kTestData[] =
        {
            0xD5, 0x00, 0x00, 0x04, 0x00, 0x01, 0x00, 0x30, 0x01, 0x08, 0x79, 0x55, 0x9F, 0x15, 0x1F, 0x66,
            0x3D, 0x8F, 0x24, 0x02, 0x05, 0x37, 0x03, 0x27, 0x13, 0x02, 0x00, 0x00, 0xEE, 0xEE, 0x30, 0xB4,
            0x18, 0x18, 0x26, 0x04, 0x80, 0x41, 0x1B, 0x23, 0x26, 0x05, 0x7F, 0xFF, 0xFF, 0x52, 0x37, 0x06,
            0x27, 0x11, 0x01, 0x00, 0x00, 0x00, 0x00, 0x30, 0xB4, 0x18, 0x18, 0x24, 0x07, 0x02, 0x26, 0x08,
            0x25, 0x00, 0x5A, 0x23, 0x30, 0x0A, 0x39, 0x04, 0x9E, 0xC7, 0x77, 0xC5, 0xA4, 0x13, 0x31, 0xF7,
            0x72, 0x2E, 0x27, 0xC2, 0x86, 0x3D, 0xC5, 0x2E, 0xD5, 0xD2, 0x3C, 0xCF, 0x7E, 0x06, 0xE3, 0x48,
            0x53, 0x87, 0xE8, 0x4D, 0xB0, 0x27, 0x07, 0x58, 0x4A, 0x38, 0xB4, 0xF3, 0xB2, 0x47, 0x94, 0x45,
            0x58, 0x65, 0x80, 0x08, 0x17, 0x6B, 0x8E, 0x4F, 0x07, 0x41, 0xA3, 0x3D, 0x5D, 0xCE, 0x76, 0x86,
            0x35, 0x83, 0x29, 0x01, 0x18, 0x35, 0x82, 0x29, 0x01, 0x24, 0x02, 0x05, 0x18, 0x35, 0x84, 0x29,
            0x01, 0x36, 0x02, 0x04, 0x02, 0x04, 0x01, 0x18, 0x18, 0x35, 0x81, 0x30, 0x02, 0x08, 0x42, 0xBD,
            0x2C, 0x6B, 0x5B, 0x3A, 0x18, 0x16, 0x18, 0x35, 0x80, 0x30, 0x02, 0x08, 0x44, 0xE3, 0x40, 0x38,
            0xA9, 0xD4, 0xB5, 0xA7, 0x18, 0x35, 0x0C, 0x30, 0x01, 0x19, 0x00, 0xA6, 0x5D, 0x54, 0xF5, 0xAE,
            0x5D, 0x63, 0xEB, 0x69, 0xD8, 0xDB, 0xCB, 0xE2, 0x20, 0x0C, 0xD5, 0x6F, 0x43, 0x5E, 0x96, 0xA8,
            0x54, 0xB2, 0x74, 0x30, 0x02, 0x19, 0x00, 0xE0, 0x37, 0x02, 0x8B, 0xB3, 0x04, 0x06, 0xDD, 0xBD,
            0x28, 0xAA, 0xC4, 0xF1, 0xFF, 0xFB, 0xB1, 0xD4, 0x1C, 0x78, 0x40, 0xDA, 0x2C, 0xD8, 0x40, 0x18,
            0x18,
        };
        uint8_t buf[512];
        size_t dataLen;

        for (int i = 0; i < 100; i++)
        {
            err = WriteConfigValueBin(kConfigKey_MfrDeviceCert, kTestData, sizeof(kTestData));
            VerifyOrDie(err == CHIP_NO_ERROR);

            vTaskDelay(pdMS_TO_TICKS(50));
        }

        err = ReadConfigValueBin(kConfigKey_MfrDeviceCert, buf, sizeof(buf), dataLen);
        VerifyOrDie(err == CHIP_NO_ERROR);

        VerifyOrDie(dataLen == sizeof(kTestData));
        VerifyOrDie(memcmp(buf, kTestData, dataLen) == 0);
    }
}



} // namespace Internal
} // namespace DeviceLayer
} // namespace chip
